import React from 'react';
import BoxComponent from './Box';
import TypographyComponent from './Typography';
import DetailNews from './DetailNews';

export default function NewsBox(props) {
  return (
    <BoxComponent>
         <TypographyComponent
        textAlign='right'
        fontSize='35px'
        fontWeight='700'
        marginTop='20px'
        marginBottom='20px'
        color='var(--primary)'
        borderBottom='1px solid var(--secondary)'
        >{props.title}</TypographyComponent>
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />
<DetailNews
        title="پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
        img="Images/ik.png"
        detail=" پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان پارٹی تیار ہے، سڑکوں پر آنے کا اعلان جلد کریں گے، عمران خان"
      />

    </BoxComponent>
  );
}
